Revit 2027 API
RasterQualityType Enumeration
 An enumerated type listing the options for raster quality.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RasterQualityType
Public Enumeration RasterQualityType
public enum class RasterQualityType
type RasterQualityType
Members
Member name | Value | Description
High | 300 |  The type of Raster Quality is High.
Low | 72 |  The type of Raster Quality is Low.
Medium | 150 |  The type of Raster Quality is Medium.
Presentation | 600 |  The type of Raster Quality is Presentation.
See Also
Reference
Autodesk.Revit.DB Namespace